jaszczurtd/JaszczurHAL/src/hal/impl/stm32g474/port/stm32g474_regs.h
#pragma once

/**
 * @file stm32g474_regs.h
 * @brief Minimal, self-contained register map for the STM32G474 bring-up.
 *
 * This is a deliberately tiny "CMSIS-light" header. It defines ONLY the
 * peripherals the first real backend step needs (RCC, GPIO, USART2, SysTick,
 * SCB). It exists so the first hardware bring-up has zero dependency on the
 * full STM32CubeG4 package; once the backend grows past the blink milestone
 * the recommended path is to pull CubeG4 LL drivers and replace this header.
 *
 * Addresses/bit positions are per RM0440 (STM32G4 reference manual) and the
 * Arm Cortex-M4 architecture (system control space).
 *
 * Only compiled meaningfully on the ARM target.
 */

#include <stdint.h>

#include "stm32g474_clock.h"

/* Fixed MMIO addresses have no source-pointer provenance to preserve.
 * uintptr_t also keeps dynamic addresses intact in 64-bit host builds. */
/* NOLINTBEGIN(performance-no-int-to-ptr) */
#define JH_REG8(addr) (*(volatile uint8_t *)(uintptr_t)(addr))
#define JH_REG16(addr) (*(volatile uint16_t *)(uintptr_t)(addr))
#define JH_REG32(addr) (*(volatile uint32_t *)(uintptr_t)(addr))
/* NOLINTEND(performance-no-int-to-ptr) */

/* ── RCC (Reset & Clock Control) ─────────────────────────────────────────── */
#define RCC_BASE 0x40021000u
#define RCC_CR JH_REG32(RCC_BASE + 0x00u)
#define RCC_CFGR JH_REG32(RCC_BASE + 0x08u)
#define RCC_PLLCFGR JH_REG32(RCC_BASE + 0x0Cu)
#define RCC_AHB1ENR JH_REG32(RCC_BASE + 0x48u)  /* DMA / DMAMUX clocks   */
#define RCC_AHB2ENR JH_REG32(RCC_BASE + 0x4Cu)  /* GPIO port clocks      */
#define RCC_APB1ENR1 JH_REG32(RCC_BASE + 0x58u) /* TIM2.. / USART2 / SPI2 */
#define RCC_APB2ENR JH_REG32(RCC_BASE + 0x60u)  /* TIM15.. / USART1 / SPI1 */
#define RCC_CCIPR JH_REG32(RCC_BASE + 0x88u)    /* peripheral clock muxes  */
#define RCC_BDCR JH_REG32(RCC_BASE + 0x90u)     /* backup-domain clocks    */
#define RCC_CSR JH_REG32(RCC_BASE + 0x94u)      /* reset flags / clear    */
#define RCC_CRRCR JH_REG32(RCC_BASE + 0x98u)    /* HSI48 control/status    */

#define RCC_CR_HSION (1u << 8)
#define RCC_CR_HSIRDY (1u << 10)
#define RCC_CR_PLLON (1u << 24)
#define RCC_CR_PLLRDY (1u << 25)

#define RCC_CFGR_SW_MASK (0x3u << 0)
#define RCC_CFGR_SW_PLL (0x3u << 0)
#define RCC_CFGR_SWS_MASK (0x3u << 2)
#define RCC_CFGR_SWS_PLL (0x3u << 2)
#define RCC_CFGR_HPRE_MASK (0xFu << 4)
#define RCC_CFGR_HPRE_DIV1 (0x0u << 4)
#define RCC_CFGR_HPRE_DIV2 (0x8u << 4)
#define RCC_CFGR_PPRE1_MASK (0x7u << 8)
#define RCC_CFGR_PPRE1_DIV1 (0x0u << 8)
#define RCC_CFGR_PPRE2_MASK (0x7u << 11)
#define RCC_CFGR_PPRE2_DIV1 (0x0u << 11)

#define RCC_PLLCFGR_PLLSRC_MASK (0x3u << 0)
#define RCC_PLLCFGR_PLLSRC_HSI (0x2u << 0)
#define RCC_PLLCFGR_PLLM_MASK (0x7u << 4)
#define RCC_PLLCFGR_PLLM_DIV4 (0x3u << 4)
#define RCC_PLLCFGR_PLLN_MASK (0x7Fu << 8)
#define RCC_PLLCFGR_PLLN_MUL85 (85u << 8)
#define RCC_PLLCFGR_PLLREN (1u << 24)
#define RCC_PLLCFGR_PLLR_MASK (0x3u << 25)
#define RCC_PLLCFGR_PLLR_DIV2 (0x0u << 25)

#define RCC_AHB1ENR_DMA1EN (1u << 0)
#define RCC_AHB1ENR_DMA2EN (1u << 1)
#define RCC_AHB1ENR_DMAMUX1EN (1u << 2)

#define RCC_AHB2ENR_GPIOAEN (1u << 0)
#define RCC_AHB2ENR_GPIOBEN (1u << 1)
#define RCC_AHB2ENR_GPIOCEN (1u << 2)
#define RCC_AHB2ENR_GPIODEN (1u << 3)
#define RCC_AHB2ENR_GPIOEEN (1u << 4)
#define RCC_AHB2ENR_GPIOFEN (1u << 5)
#define RCC_AHB2ENR_GPIOGEN (1u << 6)
#define RCC_AHB2ENR_RNGEN (1u << 26)

#define RCC_APB1ENR1_TIM2EN (1u << 0)
#define RCC_APB1ENR1_TIM3EN (1u << 1)
#define RCC_APB1ENR1_TIM4EN (1u << 2)
#define RCC_APB1ENR1_TIM6EN (1u << 4)
#define RCC_APB1ENR1_TIM7EN (1u << 5)
#define RCC_APB1ENR1_RTCAPBEN (1u << 10)
#define RCC_APB1ENR1_USART2EN (1u << 17)
#define RCC_APB1ENR1_SPI2EN (1u << 14)
#define RCC_APB1ENR1_SPI3EN (1u << 15)
#define RCC_APB1ENR1_I2C1EN (1u << 21)
#define RCC_APB1ENR1_I2C2EN (1u << 22)
#define RCC_APB1ENR1_FDCANEN (1u << 25)
#define RCC_APB1ENR1_PWREN (1u << 28)

#define RCC_APB2ENR_SPI1EN (1u << 12)
#define RCC_APB2ENR_TIM15EN (1u << 16)
#define RCC_APB2ENR_TIM16EN (1u << 17)
#define RCC_APB2ENR_TIM17EN (1u << 18)
#define RCC_APB2ENR_SYSCFGEN (1u << 0)

#define RCC_AHB2ENR_DAC1EN (1u << 16)
#define RCC_AHB2ENR_ADC12EN (1u << 13)

#define RCC_CCIPR_CLK48SEL_MASK (0x3u << 26)
#define RCC_CCIPR_CLK48SEL_HSI48 (0x0u << 26)
#define RCC_CCIPR_I2C1SEL_MASK (0x3u << 12)
#define RCC_CCIPR_I2C1SEL_HSI16 (0x2u << 12)
#define RCC_CCIPR_I2C2SEL_MASK (0x3u << 14)
#define RCC_CCIPR_I2C2SEL_HSI16 (0x2u << 14)
#define RCC_CCIPR_FDCANSEL_MASK (0x3u << 24)
#define RCC_CCIPR_FDCANSEL_PCLK1 (0x2u << 24)
#define RCC_CRRCR_HSI48ON (1u << 0)
#define RCC_CRRCR_HSI48RDY (1u << 1)

#define RCC_BDCR_LSEON (1u << 0)
#define RCC_BDCR_LSERDY (1u << 1)
#define RCC_BDCR_LSEBYP (1u << 2)
#define RCC_BDCR_LSECSSD (1u << 6)
#define RCC_BDCR_RTCSEL_MASK (0x3u << 8)
#define RCC_BDCR_RTCSEL_LSE (0x1u << 8)
#define RCC_BDCR_RTCSEL_LSI (0x2u << 8)
#define RCC_BDCR_RTCSEL_HSE_DIV32 (0x3u << 8)
#define RCC_BDCR_RTCEN (1u << 15)
#define RCC_BDCR_BDRST (1u << 16)

#define RCC_CSR_LSION (1u << 0)
#define RCC_CSR_LSIRDY (1u << 1)

/* RCC_CSR reset flags (RM0440 / CMSIS stm32g474xx.h). */
#define RCC_CSR_RMVF (1u << 23)
#define RCC_CSR_OBLRSTF (1u << 25)
#define RCC_CSR_PINRSTF (1u << 26)
#define RCC_CSR_BORRSTF (1u << 27)
#define RCC_CSR_SFTRSTF (1u << 28)
#define RCC_CSR_IWDGRSTF (1u << 29)
#define RCC_CSR_WWDGRSTF (1u << 30)
#define RCC_CSR_LPWRRSTF (1u << 31)

/* ── Independent watchdog (IWDG, LSI-clocked) ─────────────────────────── */
#define IWDG_BASE 0x40003000u
#define IWDG_KR JH_REG32(IWDG_BASE + 0x00u)
#define IWDG_PR JH_REG32(IWDG_BASE + 0x04u)
#define IWDG_RLR JH_REG32(IWDG_BASE + 0x08u)
#define IWDG_SR JH_REG32(IWDG_BASE + 0x0Cu)

#define IWDG_KR_RELOAD 0xAAAAu
#define IWDG_KR_WRITE_ACCESS 0x5555u
#define IWDG_KR_START 0xCCCCu
#define IWDG_RLR_MASK 0x0FFFu
#define IWDG_SR_PVU (1u << 0)
#define IWDG_SR_RVU (1u << 1)

/* ── Debug MCU freeze control ──────────────────────────────────────────── */
#define DBGMCU_BASE 0xE0042000u
#define DBGMCU_APB1FZR1 JH_REG32(DBGMCU_BASE + 0x08u)
#define DBGMCU_APB1FZR1_DBG_IWDG_STOP (1u << 12)

/* ── FLASH controller (main flash erase/program) ────────────────────────── */
#define FLASH_BASE 0x40022000u
#define FLASH_ACR JH_REG32(FLASH_BASE + 0x00u)
#define FLASH_KEYR JH_REG32(FLASH_BASE + 0x08u)
#define FLASH_SR JH_REG32(FLASH_BASE + 0x10u)
#define FLASH_CR JH_REG32(FLASH_BASE + 0x14u)

