jaszczurtd/JaszczurHAL/src/hal/impl/stm32g474/port/stm32g474_regs.h
#define FLASH_KEY1 0x45670123u
#define FLASH_KEY2 0xCDEF89ABu

#define FLASH_ACR_LATENCY_MASK (0xFu << 0)
#define FLASH_ACR_LATENCY_4WS (0x4u << 0)
#define FLASH_ACR_PRFTEN (1u << 8)
#define FLASH_ACR_ICEN (1u << 9)
#define FLASH_ACR_DCEN (1u << 10)

#define FLASH_SR_EOP (1u << 0)
#define FLASH_SR_OPERR (1u << 1)
#define FLASH_SR_PROGERR (1u << 3)
#define FLASH_SR_WRPERR (1u << 4)
#define FLASH_SR_PGAERR (1u << 5)
#define FLASH_SR_SIZERR (1u << 6)
#define FLASH_SR_PGSERR (1u << 7)
#define FLASH_SR_MISERR (1u << 8)
#define FLASH_SR_FASTERR (1u << 9)
#define FLASH_SR_RDERR (1u << 14)
#define FLASH_SR_OPTVERR (1u << 15)
#define FLASH_SR_BSY (1u << 16)
#define FLASH_SR_ERRORS                                                        \
  (FLASH_SR_OPERR | FLASH_SR_PROGERR | FLASH_SR_WRPERR | FLASH_SR_PGAERR |     \
   FLASH_SR_SIZERR | FLASH_SR_PGSERR | FLASH_SR_MISERR | FLASH_SR_FASTERR |    \
   FLASH_SR_RDERR | FLASH_SR_OPTVERR)

#define FLASH_CR_PG (1u << 0)
#define FLASH_CR_PER (1u << 1)
#define FLASH_CR_PNB_POS 3u
#define FLASH_CR_PNB_MASK (0xFFu << FLASH_CR_PNB_POS)
#define FLASH_CR_BKER (1u << 11)
#define FLASH_CR_STRT (1u << 16)
#define FLASH_CR_LOCK (1u << 31)

/* ── ADC1 + ADC12 common (single-channel polled regular conversions) ───────
 * ADC1 inputs are single-ended; the ADC kernel clock is taken from HCLK/4
 * (CKMODE=11), yielding 42.5 MHz with the 170 MHz system clock.
 * Register layout / bit positions per RM0440; pending on-silicon validation
 * (see examples/g474_adc_read). */
#define ADC1_BASE 0x50000000u
#define ADC12_COMMON_BASE 0x50000300u

#define ADC1_ISR JH_REG32(ADC1_BASE + 0x00u)
#define ADC1_CR JH_REG32(ADC1_BASE + 0x08u)
#define ADC1_CFGR JH_REG32(ADC1_BASE + 0x0Cu)
#define ADC1_SMPR1 JH_REG32(ADC1_BASE + 0x14u) /* sample time, ch 0..9   */
#define ADC1_SMPR2 JH_REG32(ADC1_BASE + 0x18u) /* sample time, ch 10..18 */
#define ADC1_SQR1 JH_REG32(ADC1_BASE + 0x30u)  /* regular sequence       */
#define ADC1_DR                                                                \
  JH_REG32(ADC1_BASE + 0x40u) /* regular data (read clears EOC)                \
                               */
#define ADC12_CCR JH_REG32(ADC12_COMMON_BASE + 0x08u)

#define ADC_ISR_ADRDY (1u << 0)
#define ADC_ISR_EOC (1u << 2)

#define ADC_CR_ADEN (1u << 0)
#define ADC_CR_ADDIS (1u << 1)
#define ADC_CR_ADSTART (1u << 2)
#define ADC_CR_ADSTP (1u << 4)
#define ADC_CR_ADVREGEN (1u << 28)
#define ADC_CR_DEEPPWD (1u << 29)
#define ADC_CR_ADCALDIF (1u << 30)
#define ADC_CR_ADCAL (1u << 31)

/* CFGR RES field [4:3]: 00 = 12-bit, 01 = 10-bit, 10 = 8-bit, 11 = 6-bit. */
#define ADC_CFGR_DMAEN (1u << 0)
#define ADC_CFGR_DMACFG (1u << 1)
#define ADC_CFGR_RES_POS 3u
#define ADC_CFGR_RES_MASK (0x3u << ADC_CFGR_RES_POS)
#define ADC_CFGR_OVRMOD (1u << 12)
#define ADC_CFGR_CONT (1u << 13)

/* SQR1: L (sequence length-1) [3:0], then SQ1..SQ4. */
#define ADC_SQR1_L_MASK 0xFu
#define ADC_SQR1_SQ1_POS 6u
#define ADC_SQR1_SQ2_POS 12u
#define ADC_SQR1_SQ3_POS 18u
#define ADC_SQR1_SQ4_POS 24u

/* Common CCR CKMODE [17:16]: 11 = synchronous HCLK/4. */
#define ADC_CCR_CKMODE_MASK (0x3u << 16)
#define ADC_CCR_CKMODE_HCLK_DIV4 (0x3u << 16)

/* Common CCR internal-path enable bits (RM0440 "ADC common control
 * register"). Cross-checked against the ST community forum (bit names for
 * G4: VREFEN/VSENSESEL/VBATEN) and libopencm3's adc_common_v2.h (same IP,
 * bit positions 22/23/24 -- that header calls bit 23 TSEN, RM0440 calls it
 * VSENSESEL; same bit). Pending on-silicon validation like the rest of this
 * ADC section. */
#define ADC_CCR_VREFEN (1u << 22)
#define ADC_CCR_VSENSESEL (1u << 23)

/* ADC1 internal channel numbers (RM0440 "Vbat, temperature sensor and
 * VrefInt channel"): IN16 = on-die temperature sensor, IN18 = VREFINT.
 * Neither is reachable through jh_stm32g474_adc1_channel_for_pin() -- they
 * have no GPIO. */
#define ADC_CHANNEL_VSENSE 16u
#define ADC_CHANNEL_VREFINT 18u

/* SMPR 3-bit sample-time code: 0b110 = 247.5 ADC clock cycles (safe for
 * higher-impedance sources during bring-up). At the CKMODE_HCLK_DIV4 kernel
 * clock (42.5 MHz) this is ~5.8us, above the >=5us minimum RM0440 requires
 * when sampling the temperature sensor or VREFINT. */
#define ADC_SMP_247CYCLES 0x6u

/* Internal-channel buffer startup wait (RM0440 "TS characteristics":
 * tSTART-RUN <= 15us in Run mode, i.e. enable/sample/disable -- not the
 * ~120us continuous-mode figure, since this driver never leaves VSENSESEL/
 * VREFEN enabled between reads). Rounded up for margin. */
#define ADC_INTERNAL_CHANNEL_STARTUP_US 20u

/* Busy-poll bound for one conversion (matches the I2C backend's style). */
#define ADC_POLL_TIMEOUT 200000u

/* ── RNG (true-random generator, clocked from HSI48) ────────────────────── */
#define RNG_BASE 0x50060800u
#define RNG_CR JH_REG32(RNG_BASE + 0x00u)
#define RNG_SR JH_REG32(RNG_BASE + 0x04u)
#define RNG_DR JH_REG32(RNG_BASE + 0x08u)

#define RNG_CR_RNGEN (1u << 2)
#define RNG_SR_DRDY (1u << 0)
#define RNG_SR_CECS (1u << 1)
#define RNG_SR_SECS (1u << 2)
#define RNG_SR_CEIS (1u << 5)
#define RNG_SR_SEIS (1u << 6)
#define RNG_SR_ERRORS (RNG_SR_CECS | RNG_SR_SECS | RNG_SR_CEIS | RNG_SR_SEIS)
#define RNG_POLL_TIMEOUT 200000u

/* ── DMA1 + DMAMUX1 ─────────────────────────────────────────────────────── */
#define DMA1_BASE 0x40020000u
#define DMA2_BASE 0x40020400u
#define DMAMUX1_BASE 0x40020800u

#define DMA_ISR(base) JH_REG32((base) + 0x00u)
#define DMA_IFCR(base) JH_REG32((base) + 0x04u)
#define DMA_CCR(base, ch) JH_REG32((base) + 0x08u + ((uint32_t)(ch) * 0x14u))
#define DMA_CNDTR(base, ch) JH_REG32((base) + 0x0Cu + ((uint32_t)(ch) * 0x14u))
#define DMA_CPAR(base, ch) JH_REG32((base) + 0x10u + ((uint32_t)(ch) * 0x14u))
#define DMA_CMAR(base, ch) JH_REG32((base) + 0x14u + ((uint32_t)(ch) * 0x14u))
#define DMAMUX_CCR(ch) JH_REG32(DMAMUX1_BASE + ((uint32_t)(ch) * 4u))

#define DMA_CCR_EN (1u << 0)
#define DMA_CCR_TCIE (1u << 1)
#define DMA_CCR_HTIE (1u << 2)
#define DMA_CCR_TEIE (1u << 3)
#define DMA_CCR_DIR (1u << 4)
#define DMA_CCR_CIRC (1u << 5)
#define DMA_CCR_PINC (1u << 6)
#define DMA_CCR_MINC (1u << 7)
#define DMA_CCR_PSIZE_16 (1u << 8)
#define DMA_CCR_MSIZE_16 (1u << 10)
#define DMA_CCR_PSIZE_32 (2u << 8)
#define DMA_CCR_MSIZE_32 (2u << 10)
#define DMA_CCR_PL_HIGH (2u << 12)

#define DMA_FLAG_GIF(ch) (1u << ((uint32_t)(ch) * 4u))
#define DMA_FLAG_TCIF(ch) (1u << (((uint32_t)(ch) * 4u) + 1u))
#define DMA_FLAG_HTIF(ch) (1u << (((uint32_t)(ch) * 4u) + 2u))
#define DMA_FLAG_TEIF(ch) (1u << (((uint32_t)(ch) * 4u) + 3u))
#define DMA_IFCR_CLEAR_ALL(ch)                                                 \
  (DMA_FLAG_GIF(ch) | DMA_FLAG_TCIF(ch) | DMA_FLAG_HTIF(ch) | DMA_FLAG_TEIF(ch))

#define DMAMUX_CCR_DMAREQ_ID_MASK 0x7Fu

/* Values from ST stm32g4xx_hal_dma.h for STM32G4 DMAMUX1 requests. */
#define DMA_REQUEST_ADC1 5u
#define DMA_REQUEST_SPI1_TX 11u
#define DMA_REQUEST_SPI2_TX 13u
#define DMA_REQUEST_TIM2_UP 60u
#define DMA_REQUEST_TIM3_UP 65u
#define DMA_REQUEST_TIM4_UP 71u
#define DMA_REQUEST_TIM5_CH1 72u
#define DMA_REQUEST_TIM15_UP 79u
#define DMA_REQUEST_TIM16_UP 83u
#define DMA_REQUEST_TIM17_UP 85u

