jaszczurtd/JaszczurHAL/src/hal/impl/stm32g474/port/stm32g474_regs.h
/* ── DAC1 (DAC1_OUT1 = PA4, DAC1_OUT2 = PA5) ─────────────────────────────── */
#define DAC1_BASE 0x50000800u
#define DAC1_CR JH_REG32(DAC1_BASE + 0x00u)
#define DAC1_DHR12R1                                                           \
  JH_REG32(DAC1_BASE + 0x08u) /* ch1, 12-bit right-aligned                     \
                               */
#define DAC1_DHR12R2                                                           \
  JH_REG32(DAC1_BASE + 0x14u) /* ch2, 12-bit right-aligned                     \
                               */
#define DAC_CR_EN1 (1u << 0)
#define DAC_CR_EN2 (1u << 16)

/* ── TIM2 (32-bit GP timer; used as a pulse counter on TIM2_CH1 = PA0/AF1) ──
 */
#define TIM2_BASE 0x40000000u
#define TIM3_BASE 0x40000400u
#define TIM4_BASE 0x40000800u
#define TIM5_BASE 0x40000C00u
#define TIM6_BASE 0x40001000u
#define TIM7_BASE 0x40001400u
#define TIM15_BASE 0x40014000u
#define TIM16_BASE 0x40014400u
#define TIM17_BASE 0x40014800u

#define TIM_CR1(base) JH_REG32((base) + 0x00u)
#define TIM_SMCR(base) JH_REG32((base) + 0x08u)
#define TIM_DIER(base) JH_REG32((base) + 0x0Cu)
#define TIM_SR(base) JH_REG32((base) + 0x10u)
#define TIM_EGR(base) JH_REG32((base) + 0x14u)
#define TIM_CCMR1_REG(base) JH_REG32((base) + 0x18u)
#define TIM_CCMR2_REG(base) JH_REG32((base) + 0x1Cu)
#define TIM_CCER_REG(base) JH_REG32((base) + 0x20u)
#define TIM_CNT(base) JH_REG32((base) + 0x24u)
#define TIM_PSC(base) JH_REG32((base) + 0x28u)
#define TIM_ARR(base) JH_REG32((base) + 0x2Cu)
#define TIM_CCR1(base) JH_REG32((base) + 0x34u)
#define TIM_CCR2(base) JH_REG32((base) + 0x38u)
#define TIM_CCR3(base) JH_REG32((base) + 0x3Cu)
#define TIM_CCR4(base) JH_REG32((base) + 0x40u)
#define TIM_BDTR(base) JH_REG32((base) + 0x44u)

#define TIM2_CR1 JH_REG32(TIM2_BASE + 0x00u)
#define TIM2_SMCR JH_REG32(TIM2_BASE + 0x08u) /* slave-mode / ext clock */
#define TIM2_CCMR1 JH_REG32(TIM2_BASE + 0x18u)
#define TIM2_CCER JH_REG32(TIM2_BASE + 0x20u)
#define TIM2_CNT JH_REG32(TIM2_BASE + 0x24u)
#define TIM2_ARR JH_REG32(TIM2_BASE + 0x2Cu)
#define TIM_CR1_CEN (1u << 0)
#define TIM_CR1_OPM (1u << 3)
#define TIM_CR1_ARPE (1u << 7)
#define TIM_DIER_UIE (1u << 0)
#define TIM_DIER_UDE (1u << 8)
#define TIM_DIER_CC1DE (1u << 9)
#define TIM_SR_CC1OF (1u << 9)
#define TIM_SR_UIF (1u << 0)
#define TIM_EGR_UG (1u << 0)

#define TIM_CCMR1_CC1S_MASK (0x3u << 0)
#define TIM_CCMR1_OC1PE (1u << 3)
#define TIM_CCMR1_OC1M_MASK ((0x7u << 4) | (1u << 16))
#define TIM_CCMR1_OC1M_PWM1 (0x6u << 4)
#define TIM_CCMR1_CC2S_MASK (0x3u << 8)
#define TIM_CCMR1_OC2PE (1u << 11)
#define TIM_CCMR1_OC2M_MASK ((0x7u << 12) | (1u << 24))
#define TIM_CCMR1_OC2M_PWM1 (0x6u << 12)

#define TIM_CCMR2_CC3S_MASK (0x3u << 0)
#define TIM_CCMR2_OC3PE (1u << 3)
#define TIM_CCMR2_OC3M_MASK ((0x7u << 4) | (1u << 16))
#define TIM_CCMR2_OC3M_PWM1 (0x6u << 4)
#define TIM_CCMR2_CC4S_MASK (0x3u << 8)
#define TIM_CCMR2_OC4PE (1u << 11)
#define TIM_CCMR2_OC4M_MASK ((0x7u << 12) | (1u << 24))
#define TIM_CCMR2_OC4M_PWM1 (0x6u << 12)

/* CCMR1: CC1S = 01 -> IC1 mapped on TI1. */
#define TIM_CCMR1_CC1S_TI1 (0x1u << 0)
/* CCER capture-input polarity: 00 rising, 10 falling, 11 both. */
#define TIM_CCER_CC1E (1u << 0)
#define TIM_CCER_CC1P (1u << 1)
#define TIM_CCER_CC1NP (1u << 3)
#define TIM_CCER_CC2E (1u << 4)
#define TIM_CCER_CC3E (1u << 8)
#define TIM_CCER_CC4E (1u << 12)
#define TIM_BDTR_MOE (1u << 15)
/* SMCR: SMS=111 external clock mode 1; TS=101 selects TI1FP1. */
#define TIM_SMCR_SMS_EXT1 (0x7u << 0)
#define TIM_SMCR_TS_TI1FP1 (0x5u << 4)

/* ── I2C1 (I2C v2 peripheral; SCL=PB8, SDA=PB9, AF4 on Nucleo-G474RE) ───────
 */
#define I2C1_BASE 0x40005400u
#define I2C2_BASE 0x40005800u

#define I2C_CR1_REG(base) JH_REG32((base) + 0x00u)
#define I2C_CR2_REG(base) JH_REG32((base) + 0x04u)
#define I2C_TIMINGR_REG(base) JH_REG32((base) + 0x10u)
#define I2C_ISR_REG(base) JH_REG32((base) + 0x18u)
#define I2C_ICR_REG(base) JH_REG32((base) + 0x1Cu)
#define I2C_RXDR_REG(base) JH_REG32((base) + 0x24u)
#define I2C_TXDR_REG(base) JH_REG32((base) + 0x28u)

#define I2C1_CR1 JH_REG32(I2C1_BASE + 0x00u)
#define I2C1_CR2 JH_REG32(I2C1_BASE + 0x04u)
#define I2C1_TIMINGR JH_REG32(I2C1_BASE + 0x10u)
#define I2C1_ISR JH_REG32(I2C1_BASE + 0x18u)
#define I2C1_ICR JH_REG32(I2C1_BASE + 0x1Cu)
#define I2C1_RXDR JH_REG32(I2C1_BASE + 0x24u)
#define I2C1_TXDR JH_REG32(I2C1_BASE + 0x28u)

#define I2C2_CR1 JH_REG32(I2C2_BASE + 0x00u)
#define I2C2_CR2 JH_REG32(I2C2_BASE + 0x04u)
#define I2C2_TIMINGR JH_REG32(I2C2_BASE + 0x10u)
#define I2C2_ISR JH_REG32(I2C2_BASE + 0x18u)
#define I2C2_ICR JH_REG32(I2C2_BASE + 0x1Cu)
#define I2C2_RXDR JH_REG32(I2C2_BASE + 0x24u)
#define I2C2_TXDR JH_REG32(I2C2_BASE + 0x28u)

#define I2C_CR1_PE (1u << 0)
#define I2C_CR1_TXIE (1u << 1)
#define I2C_CR1_RXIE (1u << 2)
#define I2C_CR1_ADDRIE (1u << 3)
#define I2C_CR1_NACKIE (1u << 4)
#define I2C_CR1_STOPIE (1u << 5)
#define I2C_CR1_ERRIE (1u << 7)
#define I2C_OAR1_REG(base) JH_REG32((base) + 0x08u)
#define I2C_OAR1_OA1EN (1u << 15)
#define I2C_CR2_RD_WRN (1u << 10)
#define I2C_CR2_ADD10 (1u << 11)
/* 10-bit header-only-read shortcut. Deliberately unused: the mainline Linux
 * i2c-stm32f7 driver (same I2C v2 IP as G474) always clears HEAD10R and lets
 * the peripheral send the complete 10-bit address sequence on every
 * START/repeated-START, for both write and read phases. Defined here for
 * completeness/documentation only. */
#define I2C_CR2_HEAD10R (1u << 12)
#define I2C_CR2_START (1u << 13)
#define I2C_CR2_STOP (1u << 14)
#define I2C_CR2_AUTOEND (1u << 25)
#define I2C_ISR_TXE (1u << 0)
#define I2C_ISR_TXIS (1u << 1)
#define I2C_ISR_RXNE (1u << 2)
#define I2C_ISR_ADDR (1u << 3)
#define I2C_ISR_NACKF (1u << 4)
#define I2C_ISR_STOPF (1u << 5)
#define I2C_ISR_TC (1u << 6)
#define I2C_ISR_BERR (1u << 8)
#define I2C_ISR_ARLO (1u << 9)
#define I2C_ISR_OVR (1u << 10)
#define I2C_ISR_BUSY (1u << 15)
#define I2C_ISR_DIR (1u << 16)
#define I2C_ICR_ADDRCF (1u << 3)
#define I2C_ICR_NACKCF (1u << 4)
#define I2C_ICR_STOPCF (1u << 5)
#define I2C_ICR_BERRCF (1u << 8)
#define I2C_ICR_ARLOCF (1u << 9)
#define I2C_ICR_OVRCF (1u << 10)

/* TIMINGR for I2CCLK = 16 MHz. Startup explicitly selects HSI16 as the I2C1
 * and I2C2 kernel source, so these values are independent of PCLK1. */
#define I2C_TIMINGR_100K_16MHZ 0x30420F13u

