jaszczurtd/JaszczurHAL/src/hal/impl/stm32g474/port/stm32g474_regs.h
/* Conservative presets for I2CCLK = 16 MHz. They keep the backend
 * dependency-free while still honoring
 * HAL_I2C_CLOCK_{STANDARD,FAST,FAST_PLUS}_HZ requests. */
#define I2C_TIMINGR_400K_16MHZ 0x1010060Cu
#define I2C_TIMINGR_1M_16MHZ 0x00100509u

/* ── SPI master (SPI1/SPI2; 8-bit full-duplex, software NSS) ─────────────── */
#define SPI1_BASE 0x40013000u
#define SPI2_BASE 0x40003800u
#define SPI3_BASE 0x40003C00u

#define SPI_CR1(base) JH_REG32((base) + 0x00u)
#define SPI_CR2(base) JH_REG32((base) + 0x04u)
#define SPI_SR(base) JH_REG32((base) + 0x08u)
#define SPI_DR(base) JH_REG32((base) + 0x0Cu)
#define SPI_DR8(base) JH_REG8((base) + 0x0Cu)

#define SPI_CR1_CPHA (1u << 0)
#define SPI_CR1_CPOL (1u << 1)
#define SPI_CR1_MSTR (1u << 2)
#define SPI_CR1_BR_POS 3u
#define SPI_CR1_BR_MASK (0x7u << SPI_CR1_BR_POS)
#define SPI_CR1_SPE (1u << 6)
#define SPI_CR1_LSBFIRST (1u << 7)
#define SPI_CR1_SSI (1u << 8)
#define SPI_CR1_SSM (1u << 9)

#define SPI_CR2_TXDMAEN (1u << 1)
#define SPI_CR2_DS_POS 8u
#define SPI_CR2_DS_8BIT (0x7u << SPI_CR2_DS_POS)
#define SPI_CR2_FRXTH (1u << 12)

#define SPI_SR_RXNE (1u << 0)
#define SPI_SR_TXE (1u << 1)
#define SPI_SR_OVR (1u << 6)
#define SPI_SR_BSY (1u << 7)

#define SPI_POLL_TIMEOUT 200000u

/* ── GPIO ─────────────────────────────────────────────────────────────────
 * 7 ports A..G, each spaced 0x400 apart starting at 0x48000000.
 */
#define GPIO_PORT_BASE(idx) (0x48000000u + (uint32_t)(idx) * 0x400u)

#define GPIO_MODER(idx) JH_REG32(GPIO_PORT_BASE(idx) + 0x00u)
#define GPIO_OTYPER(idx) JH_REG32(GPIO_PORT_BASE(idx) + 0x04u)
#define GPIO_OSPEEDR(idx) JH_REG32(GPIO_PORT_BASE(idx) + 0x08u)
#define GPIO_PUPDR(idx) JH_REG32(GPIO_PORT_BASE(idx) + 0x0Cu)
#define GPIO_IDR(idx) JH_REG32(GPIO_PORT_BASE(idx) + 0x10u)
#define GPIO_ODR(idx) JH_REG32(GPIO_PORT_BASE(idx) + 0x14u)
#define GPIO_BSRR(idx) JH_REG32(GPIO_PORT_BASE(idx) + 0x18u)
#define GPIO_AFRL(idx) JH_REG32(GPIO_PORT_BASE(idx) + 0x20u)
#define GPIO_AFRH(idx) JH_REG32(GPIO_PORT_BASE(idx) + 0x24u)

/* MODER 2-bit fields: 00 input, 01 output, 10 alternate-function, 11 analog. */
#define GPIO_MODE_INPUT 0x0u
#define GPIO_MODE_OUTPUT 0x1u
#define GPIO_MODE_AF 0x2u
#define GPIO_MODE_ANALOG 0x3u

/* PUPDR 2-bit fields: 00 none, 01 pull-up, 10 pull-down. */
#define GPIO_PUPD_NONE 0x0u
#define GPIO_PUPD_UP 0x1u
#define GPIO_PUPD_DOWN 0x2u

/* ── FDCAN1 (STM32G474 native Bosch M_CAN-derived controller) ───────────── */
#define FDCAN1_BASE 0x40006400u
#define FDCAN_SRAM_BASE 0x4000AC00u

#define FDCAN_REG(base, off) JH_REG32((base) + (off))
#define FDCAN_DBTP(base) FDCAN_REG((base), 0x00Cu)
#define FDCAN_TEST(base) FDCAN_REG((base), 0x010u)
#define FDCAN_CCCR(base) FDCAN_REG((base), 0x018u)
#define FDCAN_NBTP(base) FDCAN_REG((base), 0x01Cu)
#define FDCAN_ECR(base) FDCAN_REG((base), 0x040u)
#define FDCAN_PSR(base) FDCAN_REG((base), 0x044u)
#define FDCAN_TDCR(base) FDCAN_REG((base), 0x048u)
#define FDCAN_IR(base) FDCAN_REG((base), 0x050u)
#define FDCAN_IE(base) FDCAN_REG((base), 0x054u)
#define FDCAN_RXGFC(base) FDCAN_REG((base), 0x080u)
#define FDCAN_SIDFC(base) FDCAN_REG((base), 0x084u)
#define FDCAN_XIDFC(base) FDCAN_REG((base), 0x088u)
#define FDCAN_XIDAM(base) FDCAN_REG((base), 0x090u)
#define FDCAN_RXF0C(base) FDCAN_REG((base), 0x0A0u)
#define FDCAN_RXF0S(base) FDCAN_REG((base), 0x0A4u)
#define FDCAN_RXF0A(base) FDCAN_REG((base), 0x0A8u)
#define FDCAN_RXF1C(base) FDCAN_REG((base), 0x0B0u)
#define FDCAN_RXESC(base) FDCAN_REG((base), 0x0BCu)
#define FDCAN_TXBC(base) FDCAN_REG((base), 0x0C0u)
#define FDCAN_TXFQS(base) FDCAN_REG((base), 0x0C4u)
#define FDCAN_TXESC(base) FDCAN_REG((base), 0x0C8u)
#define FDCAN_TXBRP(base) FDCAN_REG((base), 0x0CCu)
#define FDCAN_TXBAR(base) FDCAN_REG((base), 0x0D0u)
#define FDCAN_TXBCR(base) FDCAN_REG((base), 0x0D4u)
#define FDCAN_TXBTO(base) FDCAN_REG((base), 0x0D8u)
#define FDCAN_TXBCF(base) FDCAN_REG((base), 0x0DCu)
#define FDCAN_TXEFC(base) FDCAN_REG((base), 0x0F0u)

#define FDCAN_CCCR_INIT (1u << 0)
#define FDCAN_CCCR_CCE (1u << 1)
#define FDCAN_CCCR_ASM (1u << 2)
#define FDCAN_CCCR_CSR (1u << 4)
#define FDCAN_CCCR_MON (1u << 5)
#define FDCAN_CCCR_DAR (1u << 6)
#define FDCAN_CCCR_TEST (1u << 7)
#define FDCAN_CCCR_FDOE (1u << 8)
#define FDCAN_CCCR_BRSE (1u << 9)

#define FDCAN_TEST_LBCK (1u << 4)
#define FDCAN_IR_ALL 0xFFFFFFFFu
#define FDCAN_PSR_EP (1u << 5)
#define FDCAN_PSR_EW (1u << 6)
#define FDCAN_PSR_BO (1u << 7)
#define FDCAN_ECR_TEC_MASK 0xFFu
#define FDCAN_ECR_REC_MASK (0x7Fu << 8)

#define FDCAN_TXBC_TFQM (1u << 30)
#define FDCAN_ELEM_SIZE_64 7u
#define FDCAN_RXF0S_F0FL_MASK 0x0Fu
#define FDCAN_RXF0S_F0GI_MASK (0x3u << 8)
#define FDCAN_RXF0S_F0GI_POS 8u
#define FDCAN_RXF0A_F0AI_MASK 0x7u

#define FDCAN_MRAM_STD_FILTER_WORDS 28u
#define FDCAN_MRAM_EXT_FILTER_WORDS (8u * 2u)
#define FDCAN_MRAM_RX_FIFO0_ELEMS 3u
#define FDCAN_MRAM_RX_FIFO1_ELEMS 3u
#define FDCAN_MRAM_TX_EVENT_ELEMS 3u
#define FDCAN_MRAM_TX_BUF_ELEMS 3u
#define FDCAN_MRAM_ELEM_WORDS_64 18u

#define FDCAN_MRAM_STD_FILTER_WORD 0u
#define FDCAN_MRAM_EXT_FILTER_WORD                                             \
  (FDCAN_MRAM_STD_FILTER_WORD + FDCAN_MRAM_STD_FILTER_WORDS)
#define FDCAN_MRAM_RX0_WORD                                                    \
  (FDCAN_MRAM_EXT_FILTER_WORD + FDCAN_MRAM_EXT_FILTER_WORDS)
#define FDCAN_MRAM_RX1_WORD                                                    \
  (FDCAN_MRAM_RX0_WORD + (FDCAN_MRAM_RX_FIFO0_ELEMS * FDCAN_MRAM_ELEM_WORDS_64))
#define FDCAN_MRAM_TX_EVENT_WORD                                               \
  (FDCAN_MRAM_RX1_WORD + (FDCAN_MRAM_RX_FIFO1_ELEMS * FDCAN_MRAM_ELEM_WORDS_64))
#define FDCAN_MRAM_TX_BUF_WORD                                                 \
  (FDCAN_MRAM_TX_EVENT_WORD + (FDCAN_MRAM_TX_EVENT_ELEMS * 2u))

#define FDCAN_POLL_TIMEOUT 200000u

/* ── SYSCFG / EXTI (external interrupt routing) ─────────────────────────── */
#define SYSCFG_BASE 0x40010000u
#define SYSCFG_EXTICR(idx)                                                     \
  JH_REG32(SYSCFG_BASE + 0x08u + ((uint32_t)(idx) * 4u))

#define EXTI_BASE 0x40010400u
/* STM32G4 uses a combined pending register at 0x14. Do not substitute the
 * split rising/falling pending layout used by newer STM32 families. */
#define EXTI_IMR1 JH_REG32(EXTI_BASE + 0x00u)
#define EXTI_RTSR1 JH_REG32(EXTI_BASE + 0x08u)
#define EXTI_FTSR1 JH_REG32(EXTI_BASE + 0x0Cu)
#define EXTI_SWIER1 JH_REG32(EXTI_BASE + 0x10u)
#define EXTI_PR1 JH_REG32(EXTI_BASE + 0x14u)

/* ── Generic USART (v2) register accessors by peripheral base ─────────────
 * Used by the hal_uart backend for USART1 (PORT_1) and USART2 (PORT_2). The
 * debug console keeps its own dedicated USART2_* accessors below. */
#define USART_CR1(base) JH_REG32((base) + 0x00u)
#define USART_BRR(base) JH_REG32((base) + 0x0Cu)
#define USART_ISR(base) JH_REG32((base) + 0x1Cu)
#define USART_ICR(base) JH_REG32((base) + 0x20u)
#define USART_RDR(base) JH_REG32((base) + 0x24u)
#define USART_TDR(base) JH_REG32((base) + 0x28u)

