jaszczurtd/JaszczurHAL/src/hal/impl/stm32g474/port/stm32g474_regs.h
#define USART_CR1_RE_BIT (1u << 2)
#define USART_CR1_TE_BIT (1u << 3)
#define USART_ISR_PE_F (1u << 0)
#define USART_ISR_FE_F (1u << 1)
#define USART_ISR_NE_F (1u << 2)
#define USART_ISR_ORE_F (1u << 3)
#define USART_ISR_RXNE_F (1u << 5)
#define USART_ISR_LBDF_F (1u << 8)
#define USART_ISR_TXE_F (1u << 7)
#define USART_ICR_PECF_F (1u << 0)
#define USART_ICR_FECF_F (1u << 1)
#define USART_ICR_NECF_F (1u << 2)
#define USART_ICR_ORECF_F (1u << 3)
#define USART_ICR_LBDCF_F (1u << 8)

#define USART1_BASE 0x40013800u
#define RCC_APB2ENR_USART1EN (1u << 14)

/* ── USART2 (APB1, used as the debug console / ST-Link VCP on Nucleo-G474RE) */
#define USART2_BASE 0x40004400u
#define USART2_CR1 JH_REG32(USART2_BASE + 0x00u)
#define USART2_BRR JH_REG32(USART2_BASE + 0x0Cu)
#define USART2_ISR JH_REG32(USART2_BASE + 0x1Cu)
#define USART2_TDR JH_REG32(USART2_BASE + 0x28u)

#define USART_CR1_UE (1u << 0)
#define USART_CR1_RE (1u << 2)
#define USART_CR1_TE (1u << 3)
#define USART_ISR_TXE (1u << 7) /* TX data register / FIFO not full */
#define USART_ISR_TC (1u << 6)  /* transmission complete            */

/* ── SysTick (Cortex-M system timer) ─────────────────────────────────────── */
#define SYSTICK_BASE 0xE000E010u
#define SYSTICK_CTRL JH_REG32(SYSTICK_BASE + 0x00u)
#define SYSTICK_LOAD JH_REG32(SYSTICK_BASE + 0x04u)
#define SYSTICK_VAL JH_REG32(SYSTICK_BASE + 0x08u)

#define SYSTICK_CTRL_ENABLE (1u << 0)
#define SYSTICK_CTRL_TICKINT (1u << 1)
#define SYSTICK_CTRL_CLKSOURCE (1u << 2) /* processor clock */

/* ── PWR (voltage scaling / Range 1 boost) ──────────────────────────────── */
#define PWR_BASE 0x40007000u
#define PWR_CR1 JH_REG32(PWR_BASE + 0x00u)
#define PWR_SR1 JH_REG32(PWR_BASE + 0x10u)
#define PWR_SCR JH_REG32(PWR_BASE + 0x18u)
#define PWR_CR5 JH_REG32(PWR_BASE + 0x80u)
#define PWR_CR1_LPMS_MASK (0x7u << 0)
#define PWR_CR1_LPMS_STOP0 (0x0u << 0)
#define PWR_CR1_LPMS_STOP1 (0x1u << 0)
#define PWR_CR1_LPMS_STANDBY (0x3u << 0)
#define PWR_CR1_DBP (1u << 8)
#define PWR_SR1_SBF (1u << 8)
#define PWR_SCR_CSBF (1u << 8)
#define PWR_SCR_CWUF_MASK (0x1Fu << 0)
#define PWR_CR5_R1MODE (1u << 8)

/* ── RTC + TAMP backup registers ────────────────────────────────────────── */
#define RTC_BASE 0x40002800u
#define RTC_TR JH_REG32(RTC_BASE + 0x00u)
#define RTC_DR JH_REG32(RTC_BASE + 0x04u)
#define RTC_SSR JH_REG32(RTC_BASE + 0x08u)
#define RTC_ICSR JH_REG32(RTC_BASE + 0x0Cu)
#define RTC_PRER JH_REG32(RTC_BASE + 0x10u)
#define RTC_WUTR JH_REG32(RTC_BASE + 0x14u)
#define RTC_CR JH_REG32(RTC_BASE + 0x18u)
#define RTC_WPR JH_REG32(RTC_BASE + 0x24u)
#define RTC_ALRMAR JH_REG32(RTC_BASE + 0x40u)
#define RTC_ALRMASSR JH_REG32(RTC_BASE + 0x44u)
#define RTC_SR JH_REG32(RTC_BASE + 0x50u)
#define RTC_SCR JH_REG32(RTC_BASE + 0x5Cu)

#define RTC_ICSR_INIT (1u << 7)
#define RTC_ICSR_INITF (1u << 6)
#define RTC_ICSR_RSF (1u << 5)
#define RTC_ICSR_INITS (1u << 4)
#define RTC_ICSR_WUTWF (1u << 2)
#define RTC_ICSR_ALRAWF (1u << 0)

#define RTC_CR_COE (1u << 23)
#define RTC_CR_COSEL (1u << 19)
#define RTC_CR_WUTIE (1u << 14)
#define RTC_CR_ALRAIE (1u << 12)
#define RTC_CR_WUTE (1u << 10)
#define RTC_CR_ALRAE (1u << 8)
#define RTC_CR_FMT (1u << 6)
#define RTC_CR_WUCKSEL_MASK (0x7u << 0)
#define RTC_CR_WUCKSEL_CK_SPRE_16BITS (0x4u << 0)

#define RTC_SR_WUTF (1u << 2)
#define RTC_SR_ALRAF (1u << 0)
#define RTC_SCR_CWUTF (1u << 2)
#define RTC_SCR_CALRAF (1u << 0)

#define RTC_WPR_KEY1 0xCAu
#define RTC_WPR_KEY2 0x53u
#define RTC_WPR_LOCK 0xFFu

#define TAMP_BASE 0x40002400u
#define TAMP_BKPR(index) JH_REG32(TAMP_BASE + 0x100u + ((uint32_t)(index) * 4u))

/* ── NVIC (Cortex-M interrupt controller) ───────────────────────────────── */
#define NVIC_ISER(n) JH_REG32(0xE000E100u + ((uint32_t)(n) * 4u))
#define NVIC_ICER(n) JH_REG32(0xE000E180u + ((uint32_t)(n) * 4u))
#define NVIC_ICPR(n) JH_REG32(0xE000E280u + ((uint32_t)(n) * 4u))
#define NVIC_IPR8(irqn) JH_REG8(0xE000E400u + (uint32_t)(irqn))

#define TIM6_DACUNDER_IRQn 54u
#define RTC_WKUP_IRQn 3u
#define RTC_Alarm_IRQn 41u
#define DMA1_Channel1_IRQn 11u
#define DMA1_Channel7_IRQn 17u
#define DMA1_Channel8_IRQn 96u
#define I2C1_EV_IRQn 31u
#define I2C1_ER_IRQn 32u
#define I2C2_EV_IRQn 33u
#define I2C2_ER_IRQn 34u
#define EXTI0_IRQn 6u
#define EXTI1_IRQn 7u
#define EXTI2_IRQn 8u
#define EXTI3_IRQn 9u
#define EXTI4_IRQn 10u
#define EXTI9_5_IRQn 23u
#define EXTI15_10_IRQn 40u
#define JH_NVIC_PRIO_TIMER 0x80u
#define JH_NVIC_PRIO_RTC 0x80u

/* ── DWT cycle counter (Cortex-M debug block) ────────────────────────────── */
#define DWT_BASE 0xE0001000u
#define DWT_CTRL JH_REG32(DWT_BASE + 0x00u)
#define DWT_CYCCNT JH_REG32(DWT_BASE + 0x04u)

#define DWT_CTRL_CYCCNTENA (1u << 0)

/* ── CoreDebug (for enabling DWT CYCCNT) ─────────────────────────────────── */
#define COREDEBUG_BASE 0xE000EDF0u
#define COREDEBUG_DEMCR JH_REG32(COREDEBUG_BASE + 0x0Cu)

#define COREDEBUG_DEMCR_TRCENA (1u << 24)

/* ── SCB (System Control Block) ──────────────────────────────────────────── */
#define SCB_BASE 0xE000ED00u
#define SCB_ICSR JH_REG32(SCB_BASE + 0x04u)
#define SCB_VTOR JH_REG32(SCB_BASE + 0x08u)
#define SCB_AIRCR JH_REG32(SCB_BASE + 0x0Cu)
#define SCB_SCR JH_REG32(SCB_BASE + 0x10u)
#define SCB_SHCSR JH_REG32(SCB_BASE + 0x24u)
#define SCB_CFSR JH_REG32(SCB_BASE + 0x28u) /* configurable fault status */
#define SCB_CFSR_MMFSR_DACCVIOL (1u << 1)
#define SCB_CFSR_MMFSR_MSTKERR (1u << 4)
#define SCB_CFSR_MMFSR_MLSPERR (1u << 5)
#define SCB_CFSR_MMARVALID (1u << 7)
#define SCB_CFSR_BFSR_STKERR (1u << 12)
#define SCB_CFSR_BFSR_LSPERR (1u << 13)
#define SCB_HFSR JH_REG32(SCB_BASE + 0x2Cu) /* hard fault status         */
#define SCB_HFSR_FORCED (1u << 30)
#define SCB_MMFAR JH_REG32(SCB_BASE + 0x34u) /* mem-manage fault address  */
#define SCB_BFAR JH_REG32(SCB_BASE + 0x38u)  /* bus fault address         */
#define SCB_CPACR JH_REG32(SCB_BASE + 0x88u) /* coprocessor (FPU) access  */

#define SCB_SHCSR_MEMFAULTENA (1u << 16)
#define SCB_SHCSR_BUSFAULTENA (1u << 17)
#define SCB_SHCSR_USGFAULTENA (1u << 18)
#define SCB_ICSR_PENDSTCLR (1u << 25)
#define SCB_ICSR_PENDSTSET (1u << 26)
#define SCB_SCR_SLEEPDEEP (1u << 2)

/* AIRCR: write VECTKEY in the top half-word, SYSRESETREQ to reboot. */
#define SCB_AIRCR_VECTKEY (0x05FAu << 16)
#define SCB_AIRCR_SYSRESETREQ (1u << 2)

/* CPACR: full access to CP10 & CP11 (the FPU). */
#define SCB_CPACR_FPU_FULL (0xFu << 20)

/* ── MPU (Cortex-M4 memory protection unit) ─────────────────────────────── */
#define MPU_BASE 0xE000ED90u
#define MPU_TYPE JH_REG32(MPU_BASE + 0x00u)
#define MPU_CTRL JH_REG32(MPU_BASE + 0x04u)
#define MPU_RNR JH_REG32(MPU_BASE + 0x08u)
#define MPU_RBAR JH_REG32(MPU_BASE + 0x0Cu)
#define MPU_RASR JH_REG32(MPU_BASE + 0x10u)

#define MPU_CTRL_ENABLE (1u << 0)
#define MPU_CTRL_HFNMIENA (1u << 1)
#define MPU_CTRL_PRIVDEFENA (1u << 2)
#define MPU_RASR_ENABLE (1u << 0)
#define MPU_RASR_SIZE_32B (4u << 1)
#define MPU_RASR_XN (1u << 28)
#define MPU_RBAR_ADDR_MASK 0xFFFFFFE0u

/* ── Device electronic signature ─────────────────────────────────────────── */
#define STM32_UID_BASE 0x1FFF7590u /* 96-bit unique device ID (3 words) */

/* Factory ADC calibration bytes (datasheet DS12288 Rev 6, Table 5 "Temperature
 * sensor calibration values" and Table 6 "Internal voltage reference
 * calibration values"). Each is a 16-bit right-aligned raw 12-bit ADC code,
 * captured by ST at VDDA = VREF+ = 3.0V +-10mV. TS_CAL1/TS_CAL2 are acquired
 * at 30 degC/130 degC respectively; VREFINT_CAL at 30 degC. */
#define STM32_TS_CAL1_ADDR 0x1FFF75A8u
#define STM32_VREFINT_CAL_ADDR 0x1FFF75AAu
#define STM32_TS_CAL2_ADDR 0x1FFF75CAu
#define STM32_TS_CAL1_TEMP_C 30
#define STM32_TS_CAL2_TEMP_C 130
